tap 'caskroom/cask'
tap 'caskroom/versions'

# caskroom/versions
cask 'intellij-idea-ce'

# caskroom/cask
cask 'google-chrome'
cask 'firefox'
cask 'java'
cask 'virtualbox'
cask 'vagrant'
cask 'vlc'
cask 'speedcrunch'
cask 'sublime-text3'
cask 'google-cloud-sdk'
cask 'flux'
cask 'flash'
cask 'google-drive'
cask 'keepassx'
cask 'iterm2'

# homebrew
brew 'bash-completion'

brew 'macvim', args: [ 'with-override-system-vim' ]

brew 'git'
brew 'git-cola'
brew 'hub'

brew 'htop-osx'
brew 'ncdu'
brew 'wget'
brew 'ack'
brew 'p7zip'
brew 'sqlite'
brew 'tree'

brew 'scala'
brew 'sbt'
brew 'typesafe-activator'

brew 'python'

brew 'docker'
brew 'docker-compose'
brew 'docker-machine'

brew 'rbenv'
brew 'ruby-build'

