tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/services'
tap 'homebrew/php'
tap 'homebrew/completions'

# caskroom/versions
cask 'intellij-idea-ce'

# caskroom/cask
cask 'google-chrome'
cask 'firefox'
cask 'java'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vagrant'
cask 'vlc'
cask 'speedcrunch'
cask 'sublime-text'
cask 'google-cloud-sdk'
cask 'flux'
cask 'flash'
cask 'google-drive'
cask 'keepassx'
cask 'iterm2'
cask 'gitup'
cask 'tcl'
cask 'mysqlworkbench'
cask 'ipvanish-vpn'

# homebrew
brew 'bash-completion'

brew 'macvim', args: [ 'with-override-system-vim' ]

brew 'git'
brew 'git-cola'
brew 'git-lfs'
brew 'hub'

brew 'htop-osx'
brew 'ncdu'
brew 'wget'
brew 'ack'
brew 'p7zip'
brew 'sqlite'
brew 'tree'
brew 'colordiff'
brew 'watch'
brew 'jq'
brew 'tmux'

brew 'scala'
brew 'sbt'
brew 'typesafe-activator'

brew 'maven'

brew 'python'

brew 'docker'
brew 'docker-compose'
brew 'docker-machine'

brew 'rbenv'
brew 'ruby-build'

brew 'nodenv'
brew 'node-build'

brew 'gnupg2'

brew 'mysql'

brew 'composer'
brew 'composer-completion'

brew 'oath-toolkit'

